-- Инициализация пользователя для доступа с любого хота (необходимо для Docker сети)
-- Выполняется только при первом инициализировании базы данных

-- Создаем пользователя 'admin' с правом подключения с любого хоста ('%')
-- если он еще не существует
CREATE USER IF NOT EXISTS 'admin'@'%' IDENTIFIED BY 'admin_password';

-- Предоставляем все права на базу данных monitoring_db
GRANT ALL PRIVILEGES ON monitoring_db.* TO 'admin'@'%';

-- Обновляем привилегии, чтобы изменения вступили в силу немедленно
FLUSH PRIVILEGES;